# Riassunto Capitolo 5

## Pandas

Spesso Pandas, Numpy e SciPy sono usate insieme. Le principali differenze da Numpy a Pandas sono che Pandas è stata progettata per lavorare con i dati tabulati, mentre Numpy è nata per lavorare con array di dati numerici.

In [1]:
import pandas as pd

Le 2 princpali strutture dati presenti in Padas con cui si lavora sono le **serie** e i **dataframe**.

### Cosa è una serie

è un array mono dimensionale, come un oggetto che contiene una sequenza di valori, molto simile ai tipi di Numpy e un indice, composto dalle etichette. Ad esempio:

In [2]:
series = pd.Series([4,5,6,7])
series

0    4
1    5
2    6
3    7
dtype: int64

In [3]:
series.values

array([4, 5, 6, 7], dtype=int64)

In [4]:
# definire gli indici con delle etichette
series = pd.Series([4,5,6,7], index=['a','b','c','d'])
series

a    4
b    5
c    6
d    7
dtype: int64

In [5]:
#uso delle etichette per richiamare il valore
series['a']

4

In [6]:
'a' in series

True

In [7]:
sdata = {'Ohio': 35000, 'Texas': 23000, 'Oregon':12340}
series = pd.Series(sdata)
series

Ohio      35000
Texas     23000
Oregon    12340
dtype: int64

In [8]:
# passare un array di indici come indice
my_index=['a','b','c','d']
series = pd.Series([1,2,3,4],index=my_index)
series

a    1
b    2
c    3
d    4
dtype: int64

L'indice di una serie si può cambiare per assegnamento in-place, esempio:

In [9]:
series = pd.Series([4,5,6,7])
series

0    4
1    5
2    6
3    7
dtype: int64

In [10]:
print(series)

0    4
1    5
2    6
3    7
dtype: int64

In [11]:
series.index = ['Bob', 'Jeff', 'Rob', 'Tom']
print(series)

Bob     4
Jeff    5
Rob     6
Tom     7
dtype: int64

### Dataframe

Un dataframe rappresenta una tabella rettangolare di dati e contiene una collezione ordinata di colonne, ognuna delle quali può essere di un tipo differente (numerico, stringa o booleano). Il dataframe contiene sia la riga che la colonna indicizzata.

In [13]:
# ci sono molti modi di costruire un dataframe, uno ad esempio, un dizionario di liste di egual lunghezza o arrays di Numpy
data = {'state': ['Ohio', 'Oregon', 'Texas', 'Utah', 'Nevado', 'Iowa', 'Minnesota'],
            'year': [2000,2003,2004,2005,2010,2020,2019],
            'pop': [1,2,3,4,5,6,7]}
frame = pd.DataFrame(data)
frame

       state  year  pop
0       Ohio  2000    1
1     Oregon  2003    2
2      Texas  2004    3
3       Utah  2005    4
4     Nevado  2010    5
5       Iowa  2020    6
6  Minnesota  2019    7

In [14]:
# Selezione delle sole prime 5 righe
frame.head()

    state  year  pop
0    Ohio  2000    1
1  Oregon  2003    2
2   Texas  2004    3
3    Utah  2005    4
4  Nevado  2010    5

In [16]:
# Una colonna di un dataframe può essere richiamata come una serie
frame['state']

0         Ohio
1       Oregon
2        Texas
3         Utah
4       Nevado
5         Iowa
6    Minnesota
Name: state, dtype: object

In [18]:
# Una riga di un dataframe si può richiamare con i numeri e il metodo loc, che sta per lcation
frame.loc[2]

state    Texas
year      2004
pop          3
Name: 2, dtype: object

In [19]:
# Assegnare una colonna che non esiste crea una nuova colonna
frame['nuova_colonna'] = frame.state == 'Texas'

In [20]:
frame

       state  year  pop  nuova_colonna
0       Ohio  2000    1          False
1     Oregon  2003    2          False
2      Texas  2004    3           True
3       Utah  2005    4          False
4     Nevado  2010    5          False
5       Iowa  2020    6          False
6  Minnesota  2019    7          False

In [21]:
# si possono rimuovere le colonne con il metodo del
del frame['nuova_colonna']
frame

       state  year  pop
0       Ohio  2000    1
1     Oregon  2003    2
2      Texas  2004    3
3       Utah  2005    4
4     Nevado  2010    5
5       Iowa  2020    6
6  Minnesota  2019    7

In [23]:
# Transpose del dataframe
print(frame.T)
frame

          0       1      2     3       4     5          6
state  Ohio  Oregon  Texas  Utah  Nevado  Iowa  Minnesota
year   2000    2003   2004  2005    2010  2020       2019
pop       1       2      3     4       5     6          7

       state  year  pop
0       Ohio  2000    1
1     Oregon  2003    2
2      Texas  2004    3
3       Utah  2005    4
4     Nevado  2010    5
5       Iowa  2020    6
6  Minnesota  2019    7

In [24]:
frame.values

array([['Ohio', 2000, 1],
       ['Oregon', 2003, 2],
       ['Texas', 2004, 3],
       ['Utah', 2005, 4],
       ['Nevado', 2010, 5],
       ['Iowa', 2020, 6],
       ['Minnesota', 2019, 7]], dtype=object)

### Index Objects

Ogni array o qualsiasi sequenza di etichette che usiamo per costruire il nostro dataframe o serie, viene internamente convertito come se fosse un indice. Questi si chiamano **index objects**.

In [25]:
# index objects
obj = pd.Series(range(3), index=['a','b','c'])
type(obj)

pandas.core.series.Series

In [27]:
index_object = obj.index
print(type(index_object))
print(index_object)

<class 'pandas.core.indexes.base.Index'>
Index(['a', 'b', 'c'], dtype='object')

**Importante** gli index object sono immutabili e non possono venir modificati, inoltre a differenza degli insiemi Python un indice Pandas può contenere etichette duplicate.

In [29]:
index_object[1] = 'd'

TypeError: Index does not support mutable operations

### Reindex

In [33]:
obj = pd.Series(range(3), index=['a','b','c'])
obj

a    0
b    1
c    2
dtype: int64

In [37]:
# il metodo reindex, reindicizza la serie attraverso il nuovo indice
obj2 = obj.reindex(['aa','bb','cc'])
print(obj)
print(obj2)

a    0
b    1
c    2
dtype: int64
aa   NaN
bb   NaN
cc   NaN
dtype: float64

### Dropping Entries from an Axis

In [1]:
import pandas as pd
import numpy as np

obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [2]:
# posso usare il metodo drop con le serie
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [3]:
# esempio con i dataframes
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                   index=['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [4]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

### Indexing, Selection and filtering

Indicizzazione sulle Serie. Simile agli array di Numpy

In [12]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [13]:
obj['b']

1.0

In [14]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [15]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [16]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [17]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [18]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

Indicizzazione sui dataframe. Può servire per ricavare una o più colonne con un singolo valore/sequenza.

In [19]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                   index = ['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns = ['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [20]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [21]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [22]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [23]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [24]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [26]:
data[data < 5] = 0

In [27]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

### Selezione con loc e iloc

Accedi alla riga della tabella tramite gli indici, con **loc** usi le etichette e con **iloc** soltanto i numeri

In [33]:
data.loc['Colorado']

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [34]:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [35]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [36]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [37]:
data.iloc[[1,2]]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11

In [50]:
data.iloc[[1,2],[3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [51]:
# Esempi di applicazione di funzioni - FUNCTION APPLICATION

frame = pd.DataFrame(np.random.randn(4,3), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [52]:
frame

               b         d         e
Utah   -1.903157 -0.862431  1.754526
Ohio    0.045700  0.298458 -1.923357
Texas  -1.505818  0.831881 -0.648835
Oregon  0.131124  0.920081 -0.574650

In [53]:
np.abs(frame)

               b         d         e
Utah    1.903157  0.862431  1.754526
Ohio    0.045700  0.298458  1.923357
Texas   1.505818  0.831881  0.648835
Oregon  0.131124  0.920081  0.574650

In [54]:
f = lambda x: x.max() - x.min()

In [55]:
frame.apply(f)

b    2.034281
d    1.782512
e    3.677883
dtype: float64

In [58]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min','max'])

In [59]:
# applicazione di funzione f(x)
frame.apply(f)

            b         d         e
min -1.903157 -0.862431 -1.923357
max  0.131124  0.920081  1.754526

In [60]:
# Sorting and ranking
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [61]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [62]:
# per i dataframe si può riodinare per indice su entrambi gli assi
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])

In [63]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [64]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [65]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

## 5.3 Summarizing and Computing Descriptive Statistics

Gli oggetti Pandas possono operare con funzioni matematiche e statistiche, la maggior parte di queste ricadono nella famiglia delle **reductions and summary statistics**. Sono metodi
in grado di estrarre un singolo valore(la somma o la media) da una serie o una serie di valori di una riga/colonna di un dataframe. Come avveniva per gli array Numpy, c'è una soluzione automatica in caso di dati mancanti.

In [72]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
.....: [np.nan, np.nan], [0.75, -1.3]],
.....: index=['a', 'b', 'c', 'd'],
.....: columns=['one', 'two'])

In [73]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [74]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [75]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [76]:
df.mean(axis='columns',skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [77]:
df.idxmax()

one    b
two    d
dtype: object

In [78]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [82]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [83]:
obj = pd.Series(['a','a','b','c'] * 4)

In [84]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Correlazione e Covarianza

In [86]:
import pandas as pd
import pandas_datareader.data as web

In [87]:
all_data = {ticker: web.get_data_yahoo(ticker)
           for ticker in['AAPL', 'IBM', 'MSFT', 'GOOG']}

In [88]:
all_data

{'AAPL':                   High         Low        Open       Close       Volume  \
 Date
 2015-12-09   29.422501   28.770000   29.410000   28.905001  185445600.0
 2015-12-10   29.235001   28.877501   29.010000   29.042500  116850800.0
 2015-12-11   28.847500   28.212500   28.797501   28.295000  187544800.0
 2015-12-14   28.170000   27.447500   28.045000   28.120001  257274800.0
 2015-12-15   28.200001   27.587500   27.985001   27.622499  213292400.0
 ...                ...         ...         ...         ...          ...
 2020-11-30  120.970001  116.809998  116.970001  119.050003  169410200.0
 2020-12-01  123.470001  120.010002  121.010002  122.720001  128166800.0
 2020-12-02  123.370003  120.889999  122.019997  123.080002   89004200.0
 2020-12-03  123.779999  122.209999  123.519997  122.940002   78967600.0
 2020-12-04  122.860001  121.519997  122.599998  122.250000   78133200.0

              Adj Close
 Date
 2015-12-09   26.562178
 2015-12-10   26.688534
 2015-12-11   26.001623
 2015-12-14   25.840809
 2015-12-15   25.383627
 ...                ...
 2020-11-30  119.050003
 2020-12-01  122.720001
 2020-12-02  123.080002
 2020-12-03  122.940002
 2020-12-04  122.250000

 [1257 rows x 6 columns],
 'IBM':                   High         Low        Open       Close     Volume  \
 Date
 2015-12-09  139.839996  136.229996  137.380005  136.610001  4615000.0
 2015-12-10  137.850006  135.720001  137.029999  136.779999  4222300.0
 2015-12-11  135.440002  133.910004  135.229996  134.570007  5333800.0
 2015-12-14  136.139999  134.020004  135.309998  135.929993  5143800.0
 2015-12-15  138.970001  137.279999  137.399994  137.789993  4238500.0
 ...                ...         ...         ...         ...        ...
 2020-11-30  125.000000  123.089996  124.099998  123.519997  5988000.0
 2020-12-01  125.830002  123.080002  123.900002  123.160004  5312100.0
 2020-12-02  124.639999  122.410004  122.849998  124.620003  3690700.0
 2020-12-03  124.860001  123.290001  124.160004  123.610001  4548200.0
 2020-12-04  127.379997  123.639999  123.970001  127.199997  5520000.0

              Adj Close
 Date
 2015-12-09  108.845253
 2015-12-10  108.980675
 2015-12-11  107.219849
 2015-12-14  108.303436
 2015-12-15  109.785408
 ...                ...
 2020-11-30  123.519997
 2020-12-01  123.160004
 2020-12-02  124.620003
 2020-12-03  123.610001
 2020-12-04  127.199997

 [1257 rows x 6 columns],
 'MSFT':                   High         Low        Open       Close      Volume  \
 Date
 2015-12-09   55.869999   54.509998   55.369999   54.980000  36373200.0
 2015-12-10   55.660000   55.009998   55.389999   55.270000  31775800.0
 2015-12-11   55.099998   54.009998   54.709999   54.060001  39549500.0
 2015-12-14   55.209999   53.680000   54.330002   55.139999  46768900.0
 2015-12-15   55.900002   55.090000   55.660000   55.200001  39843000.0
 ...                ...         ...         ...         ...         ...
 2020-11-30  214.759995  210.839996  214.100006  214.070007  33064800.0
 2020-12-01  217.320007  213.350006  214.509995  216.210007  30931300.0
 2020-12-02  215.470001  212.800003  214.880005  215.369995  23724500.0
 2020-12-03  216.380005  213.649994  214.610001  214.240005  25120900.0
 2020-12-04  215.380005  213.179993  214.220001  214.360001  24433900.0

              Adj Close
 Date
 2015-12-09   50.170998
 2015-12-10   50.435631
 2015-12-11   49.331478
 2015-12-14   50.317013
 2015-12-15   50.371754
 ...                ...
 2020-11-30  214.070007
 2020-12-01  216.210007
 2020-12-02  215.369995
 2020-12-03  214.240005
 2020-12-04  214.360001

 [1257 rows x 6 columns],
 'GOOG':                    High          Low         Open        Close   Volume  \
 Date
 2015-12-09   764.229980   737.000977   759.169983   751.609985  2700000
 2015-12-10   755.849976   743.830017   752.849976   749.460022  1988400
 2015-12-11   745.710022   736.750000   741.159973   738.869995  2224400
 2015-12-14   748.729980   724.169983   741.789978   747.770020  2412500
 2015-12-15   758.080017   743.010010   753.000000   743.400024  2666200
 ...                 ...          ...          ...          ...      ...
 2020-11-30  1788.064941  1755.000000  1781.183960  1760.739990  1823800
 2020-12-01  1824.829956  1769.369995  1774.369995  1798.099976  1739000
 2020-12-02  1835.650024  1789.473022  1798.099976  1827.949951  1222000
 2020-12-03  1847.199951  1822.650024  1824.010010  1826.770020  1227300
 2020-12-04  1833.160034  1816.989990  1824.520020  1827.989990  1376100

               Adj Close
 Date
 2015-12-09   751.609985
 2015-12-10   749.460022
 2015-12-11   738.869995
 2015-12-14   747.770020
 2015-12-15   743.400024
 ...                 ...
 2020-11-30  1760.739990
 2020-12-01  1798.099976
 2020-12-02  1827.949951
 2020-12-03  1826.770020
 2020-12-04  1827.989990

 [1257 rows x 6 columns]}

In [93]:
all_data = {ticker: web.get_data_yahoo(ticker)
           for ticker in['AAPL', 'IBM', 'MSFT', 'GOOG']}

price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})

In [94]:
price

                  AAPL         IBM        MSFT         GOOG
Date
2015-12-09   26.562178  108.845253   50.170998   751.609985
2015-12-10   26.688534  108.980675   50.435631   749.460022
2015-12-11   26.001623  107.219849   49.331478   738.869995
2015-12-14   25.840809  108.303436   50.317013   747.770020
2015-12-15   25.383627  109.785408   50.371754   743.400024
...                ...         ...         ...          ...
2020-11-30  119.050003  123.519997  214.070007  1760.739990
2020-12-01  122.720001  123.160004  216.210007  1798.099976
2020-12-02  123.080002  124.620003  215.369995  1827.949951
2020-12-03  122.940002  123.610001  214.240005  1826.770020
2020-12-04  122.250000  127.199997  214.360001  1827.989990

[1257 rows x 4 columns]

In [95]:
volume = pd.DataFrame({ticker: data['Volume']
                      for ticker, data in all_data.items()})

In [96]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [97]:
all_data

{'AAPL':                   High         Low        Open       Close       Volume  \
 Date
 2015-12-09   29.422501   28.770000   29.410000   28.905001  185445600.0
 2015-12-10   29.235001   28.877501   29.010000   29.042500  116850800.0
 2015-12-11   28.847500   28.212500   28.797501   28.295000  187544800.0
 2015-12-14   28.170000   27.447500   28.045000   28.120001  257274800.0
 2015-12-15   28.200001   27.587500   27.985001   27.622499  213292400.0
 ...                ...         ...         ...         ...          ...
 2020-11-30  120.970001  116.809998  116.970001  119.050003  169410200.0
 2020-12-01  123.470001  120.010002  121.010002  122.720001  128166800.0
 2020-12-02  123.370003  120.889999  122.019997  123.080002   89004200.0
 2020-12-03  123.779999  122.209999  123.519997  122.940002   78967600.0
 2020-12-04  122.860001  121.519997  122.599998  122.250000   78133200.0

              Adj Close
 Date
 2015-12-09   26.562178
 2015-12-10   26.688534
 2015-12-11   26.001623
 2015-12-14   25.840809
 2015-12-15   25.383627
 ...                ...
 2020-11-30  119.050003
 2020-12-01  122.720001
 2020-12-02  123.080002
 2020-12-03  122.940002
 2020-12-04  122.250000

 [1257 rows x 6 columns],
 'IBM':                   High         Low        Open       Close     Volume  \
 Date
 2015-12-09  139.839996  136.229996  137.380005  136.610001  4615000.0
 2015-12-10  137.850006  135.720001  137.029999  136.779999  4222300.0
 2015-12-11  135.440002  133.910004  135.229996  134.570007  5333800.0
 2015-12-14  136.139999  134.020004  135.309998  135.929993  5143800.0
 2015-12-15  138.970001  137.279999  137.399994  137.789993  4238500.0
 ...                ...         ...         ...         ...        ...
 2020-11-30  125.000000  123.089996  124.099998  123.519997  5988000.0
 2020-12-01  125.830002  123.080002  123.900002  123.160004  5312100.0
 2020-12-02  124.639999  122.410004  122.849998  124.620003  3690700.0
 2020-12-03  124.860001  123.290001  124.160004  123.610001  4548200.0
 2020-12-04  127.379997  123.639999  123.970001  127.199997  5520000.0

              Adj Close
 Date
 2015-12-09  108.845253
 2015-12-10  108.980675
 2015-12-11  107.219849
 2015-12-14  108.303436
 2015-12-15  109.785408
 ...                ...
 2020-11-30  123.519997
 2020-12-01  123.160004
 2020-12-02  124.620003
 2020-12-03  123.610001
 2020-12-04  127.199997

 [1257 rows x 6 columns],
 'MSFT':                   High         Low        Open       Close      Volume  \
 Date
 2015-12-09   55.869999   54.509998   55.369999   54.980000  36373200.0
 2015-12-10   55.660000   55.009998   55.389999   55.270000  31775800.0
 2015-12-11   55.099998   54.009998   54.709999   54.060001  39549500.0
 2015-12-14   55.209999   53.680000   54.330002   55.139999  46768900.0
 2015-12-15   55.900002   55.090000   55.660000   55.200001  39843000.0
 ...                ...         ...         ...         ...         ...
 2020-11-30  214.759995  210.839996  214.100006  214.070007  33064800.0
 2020-12-01  217.320007  213.350006  214.509995  216.210007  30931300.0
 2020-12-02  215.470001  212.800003  214.880005  215.369995  23724500.0
 2020-12-03  216.380005  213.649994  214.610001  214.240005  25120900.0
 2020-12-04  215.380005  213.179993  214.220001  214.360001  24433900.0

              Adj Close
 Date
 2015-12-09   50.170998
 2015-12-10   50.435631
 2015-12-11   49.331478
 2015-12-14   50.317013
 2015-12-15   50.371754
 ...                ...
 2020-11-30  214.070007
 2020-12-01  216.210007
 2020-12-02  215.369995
 2020-12-03  214.240005
 2020-12-04  214.360001

 [1257 rows x 6 columns],
 'GOOG':                    High          Low         Open        Close   Volume  \
 Date
 2015-12-09   764.229980   737.000977   759.169983   751.609985  2700000
 2015-12-10   755.849976   743.830017   752.849976   749.460022  1988400
 2015-12-11   745.710022   736.750000   741.159973   738.869995  2224400
 2015-12-14   748.729980   724.169983   741.789978   747.770020  2412500
 2015-12-15   758.080017   743.010010   753.000000   743.400024  2666200
 ...                 ...          ...          ...          ...      ...
 2020-11-30  1788.064941  1755.000000  1781.183960  1760.739990  1823800
 2020-12-01  1824.829956  1769.369995  1774.369995  1798.099976  1739000
 2020-12-02  1835.650024  1789.473022  1798.099976  1827.949951  1222000
 2020-12-03  1847.199951  1822.650024  1824.010010  1826.770020  1227300
 2020-12-04  1833.160034  1816.989990  1824.520020  1827.989990  1376100

               Adj Close
 Date
 2015-12-09   751.609985
 2015-12-10   749.460022
 2015-12-11   738.869995
 2015-12-14   747.770020
 2015-12-15   743.400024
 ...                 ...
 2020-11-30  1760.739990
 2020-12-01  1798.099976
 2020-12-02  1827.949951
 2020-12-03  1826.770020
 2020-12-04  1827.989990

 [1257 rows x 6 columns]}

In [98]:
price

                  AAPL         IBM        MSFT         GOOG
Date
2015-12-09   26.562178  108.845253   50.170998   751.609985
2015-12-10   26.688534  108.980675   50.435631   749.460022
2015-12-11   26.001623  107.219849   49.331478   738.869995
2015-12-14   25.840809  108.303436   50.317013   747.770020
2015-12-15   25.383627  109.785408   50.371754   743.400024
...                ...         ...         ...          ...
2020-11-30  119.050003  123.519997  214.070007  1760.739990
2020-12-01  122.720001  123.160004  216.210007  1798.099976
2020-12-02  123.080002  124.620003  215.369995  1827.949951
2020-12-03  122.940002  123.610001  214.240005  1826.770020
2020-12-04  122.250000  127.199997  214.360001  1827.989990

[1257 rows x 4 columns]

In [99]:
volume

                   AAPL        IBM        MSFT     GOOG
Date
2015-12-09  185445600.0  4615000.0  36373200.0  2700000
2015-12-10  116850800.0  4222300.0  31775800.0  1988400
2015-12-11  187544800.0  5333800.0  39549500.0  2224400
2015-12-14  257274800.0  5143800.0  46768900.0  2412500
2015-12-15  213292400.0  4238500.0  39843000.0  2666200
...                 ...        ...         ...      ...
2020-11-30  169410200.0  5988000.0  33064800.0  1823800
2020-12-01  128166800.0  5312100.0  30931300.0  1739000
2020-12-02   89004200.0  3690700.0  23724500.0  1222000
2020-12-03   78967600.0  4548200.0  25120900.0  1227300
2020-12-04   78133200.0  5520000.0  24433900.0  1376100

[1257 rows x 4 columns]

In [100]:
returns = price.pct_change()

In [101]:
returns

                AAPL       IBM      MSFT      GOOG
Date
2015-12-09       NaN       NaN       NaN       NaN
2015-12-10  0.004757  0.001244  0.005275 -0.002860
2015-12-11 -0.025738 -0.016157 -0.021892 -0.014130
2015-12-14 -0.006185  0.010106  0.019978  0.012045
2015-12-15 -0.017692  0.013684  0.001088 -0.005844
...              ...       ...       ...       ...
2020-11-30  0.021100 -0.006675 -0.005390 -0.018096
2020-12-01  0.030827 -0.002914  0.009997  0.021218
2020-12-02  0.002934  0.011854 -0.003885  0.016601
2020-12-03 -0.001137 -0.008105 -0.005247 -0.000645
2020-12-04 -0.005613  0.029043  0.000560  0.000668

[1257 rows x 4 columns]

In [102]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2020-11-30  0.021100 -0.006675 -0.005390 -0.018096
2020-12-01  0.030827 -0.002914  0.009997  0.021218
2020-12-02  0.002934  0.011854 -0.003885  0.016601
2020-12-03 -0.001137 -0.008105 -0.005247 -0.000645
2020-12-04 -0.005613  0.029043  0.000560  0.000668

In [103]:
returns['MSFT'].corr(returns['IBM'])

0.5595692471241618

In [105]:
returns['MSFT'].cov(returns['IBM'])

0.0001596893510030949

In [106]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.473229  0.717380  0.656984
IBM   0.473229  1.000000  0.559569  0.520597
MSFT  0.717380  0.559569  1.000000  0.780236
GOOG  0.656984  0.520597  0.780236  1.000000

In [107]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000361  0.000146  0.000239  0.000208
IBM   0.000146  0.000265  0.000160  0.000141
MSFT  0.000239  0.000160  0.000307  0.000228
GOOG  0.000208  0.000141  0.000228  0.000277

In [108]:
returns.corrwith(returns.IBM)

AAPL    0.473229
IBM     1.000000
MSFT    0.559569
GOOG    0.520597
dtype: float64

### Valori Unique

In [109]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [110]:
uniques = obj.unique()

In [111]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [112]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [113]:
pd.value_counts(obj.values, sort=False)

c    3
b    2
d    1
a    3
dtype: int64

In [114]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [115]:
boolean_mask = obj.isin(['c'])

In [116]:
boolean_mask

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7     True
8     True
dtype: bool

### Apply Function

In [117]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
.....: 'Qu2': [2, 3, 1, 2, 3],
.....: 'Qu3': [1, 5, 2, 4, 4]})

In [118]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [119]:
result = data.apply(pd.value_counts).fillna(0)

In [120]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0